Revit 2027 API
CurveByPointsUtils.GetSketchOnSurface Method
 Gets the relationship between the CurveElement and face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool GetSketchOnSurface(
	CurveElement curveElem
)
Public Shared Function GetSketchOnSurface (
	curveElem As CurveElement
) As Boolean
public:
static bool GetSketchOnSurface(
	CurveElement^ curveElem
)
static member GetSketchOnSurface :
        curveElem : CurveElement -> bool
Parameters
curveElem CurveElement
 The CurveElement.
Return Value
Boolean
 Whether or not the CurveElement should lie on the face and be able to be added to the face.
Exceptions
Exception | Condition
ArgumentException |  The input CurveElement is not a CurveByPoints.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
CurveByPointsUtils Class
Autodesk.Revit.DB Namespace